Repository: Hylo-dev/Aste-RISC
Catalog: Aste-RISC/Localizable.xcstrings
Source language: en
Languages: es_419, it

source: • Advanced code editor with syntax highlighting
es_419: • Editor de codigo avanzado con resaltado de sintaxis
it: • Editor di codice avanzato con evidenziazione della sintassi

source: • Compilation and direct execution from the IDE
es_419: • Compilación y ejecución directa desde el IDE
it: • Compilazione ed esecuzione diretta dall'IDE

source: • Integrated assembly project management
es_419: • Manejo de proyectos assembly integrado
it: • Gestione integrata dei progetti assembly

source: • Native macOS interface with Liquid Glass design
es_419: • Interfaz nativa para MacOS con el diseño Liquid Glass
it: • Interfaccia nativa macOS con design Liquid Glass

source: %@ is build
es_419: %@ ha compilado
it: %@ è compilato

source: %@ is building
es_419: %@ está compilando
it: Compilazione di %@ in corso

source: %@ is ready to build
es_419: %@ está listo para compilar
it: %@ è pronto per la compilazione

source: %@ is running
es_419: %@ se está ejecutando
it: %@ è in esecuzioni

source: %lld Active frame's
es_419: %lld Frame’s Activos
it: %lld Frame’s attivi

source: %u Bytes available
es_419: %u Bytes disponibles
it: %u Bytes disponibili

source: Active
es_419: Activo
it: Attivo

source: Address range
it: Intervallo indirizzi

source: Back
es_419: Volver
it: Indietro

source: Browse your existing projects
es_419: Busca tus proyectos existentes
it: Cerca i tuoi progetti esistenti

source: Create
es_419: Crea
it: Crea

source: Create a new assembly project
es_419: Crea un nuevo proyecto assembly
it: Crea un nuovo progetto assembly

source: Create a new Assembly project
es_419: Crea un nuevo proyecto assembly
it: Crea un nuovo progetto assembly

source: Create A New Project
es_419: Crea un nuevo proyecto
it: Crea un nuovo progetto

source: Create new project
es_419: Crear nuevo proyecto
it: Crea un nuovo progetto

source: Delete
es_419: Eliminar
it: Elimina

source: Delete Project
es_419: Eliminar proyecto
it: Elimina Progetto

source: Dynamic allocation area
es_419: Área de asignación dinámica
it: Area di allocazione dinamica

source: Editing view test
es_419: Editar vista test
it: Editare la test view

source: Editor settings
es_419: Ajustes del editor
it: Impostazioni editor

source: Editor Type
es_419: Tipo del editor
it: Tipo di editor

source: Error to create project
es_419: Error en la creación del proyecto
it: Errore nella creazione del progetto

source: Filter
es_419: Filtro
it: Filtra

source: Finished running %@
es_419: Ejecución terminada %@
it: Esecuzione di %@ terminata

source: General view settings
es_419: Ajustes de la vista general
it: Impostazioni generali della vista

source: If you haven't installed these tools, you can do so via Homebrew or Xcode Command Line Tools.
es_419: Si no tienes instalado estas herramientas, puedes hacerlo a través de Homebrew o usando la Xcode Command Line Tools.
it: Se non hai installato questi strumenti, puoi farlo tramite Homebrew o Xcode Command Line Tools.

source: Initialised global data
es_419: Datos globales inicializados
it: Dati globali inizializzati

source: Main Features:
es_419: Características Principales:
it: Funzionalità principali:

source: Name
es_419: Nombre
it: Nome

source: New Empty File
es_419: Nuevo archivo vacío
it: Nuovo File Vuoto

source: New Folder
es_419: Nueva carpeta
it: Nuova Cartella

source: Open A Existing Project
es_419: Abrir un proyecto existente
it: Apri un progetto esistente

source: Open Project
es_419: Abrir Proyecto
it: Apri Progetto

source: Open Project '%@'
es_419: Abrir Proyecto '%@'
it: Aprire il progetto '%@'

source: Open Source Native MacOS RISC-V Assembly IDE
es_419: IDE de Assembly RISC-V Nativo para MacOS de código abierto
it: IDE Assembly RISC-V Open Source nativo per macOS

source: Open Source RISC-V IDE
es_419: IDE RISC-V de código abierto
it: IDE RISC-V Open Source

source: Program instructions
es_419: Instrucciones del Programa
it: Istruzioni del programma

source: Project name:
es_419: Nombre del proyecto
it: Nome del progetto:

source: Project path:
es_419: Path del proyecto
it: Path del progetto:

source: Registers
es_419: Registros
it: Registri

source: Remove on List
es_419: Eliminar de la lista
it: Rimuovi dalla Lista

source: Rename
es_419: Renombrar
it: Rinomina

source: Run a file to see %@
es_419: Ejecutar un archivo para ver %@
it: Esegui un file per visualizzare %@

source: Settings…
es_419: Ajustes…
it: Impostazioni

source: Show in Finder
es_419: Muestra en el Finder
it: Mostra nel Finder

source: Space: %@
es_419: Espacio: %@
it: Spazio: %@

source: System requirements
es_419: Requisitos del sistema
it: Requisiti del sistema

source: Theme view test
es_419: Vista para el tema test
it: Tema view test

source: This is your new professional development environment for RISC-V Assembly. A modern IDE designed specifically for macOS.
es_419: Este es tu nuevo entorno de desarrollo profesional para Assembly RISC-V.\nUn IDE moderno diseñado específicamente para MacOS.
it: Questo è il tuo nuovo ambiente di sviluppo professionale per Assembly RISC-V.\nUn IDE moderno progettato specificamente per macOS.

source: Understand
es_419: Entendido
it: Capisco

source: Welcome to RISKit
es_419: Bienvenido a RISKit
it: Benvenuto in RISKit

source: Yes
es_419: Sí
it: Si

source: Note:
es_419: Nota:
